# Part 5

# Sorting

In [1]:
# imports
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser1 = Series([17,12,9],index=['c','a','e'])

In [3]:
ser1

c    17
a    12
e     9
dtype: int64

In [4]:
ser1.sort_index() # sort by index

a    12
c    17
e     9
dtype: int64

In [5]:
ser1.sort_values() # ser1.order() used in Python 2 - now deprecated

e     9
a    12
c    17
dtype: int64

In [6]:
from numpy.random import randn

In [7]:
ser2 = Series(randn(10))
ser2

0   -0.761616
1   -0.529688
2    0.578010
3   -0.833907
4    1.078200
5    2.761288
6    1.183942
7   -0.178477
8    1.302708
9    0.487890
dtype: float64

In [8]:
ser2.sort_values()

3   -0.833907
0   -0.761616
1   -0.529688
7   -0.178477
9    0.487890
2    0.578010
4    1.078200
6    1.183942
8    1.302708
5    2.761288
dtype: float64

In [9]:
ser2

0   -0.761616
1   -0.529688
2    0.578010
3   -0.833907
4    1.078200
5    2.761288
6    1.183942
7   -0.178477
8    1.302708
9    0.487890
dtype: float64

In [10]:
ser2.rank()

0     2.0
1     3.0
2     6.0
3     1.0
4     7.0
5    10.0
6     8.0
7     4.0
8     9.0
9     5.0
dtype: float64

In [11]:
ser3 = Series(randn(10))
ser3

0   -1.438806
1    0.889873
2    0.816573
3   -1.954350
4   -0.365200
5   -1.595054
6   -0.085903
7   -0.840694
8    0.472272
9    1.559011
dtype: float64

In [12]:
ser3.rank()

0     3.0
1     9.0
2     8.0
3     1.0
4     5.0
5     2.0
6     6.0
7     4.0
8     7.0
9    10.0
dtype: float64

In [13]:
#nfl_frame = pd.read_clipboard() # read directly from clipboard
nfl_frame = pd.read_csv('data/nfl_frame.csv')

In [14]:
nfl_frame

,Unnamed: 0,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
1,1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
3,3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
4,4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East
5,5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North
6,6,7,Baltimore Ravens,352,190,161,1,0.541,1996,AFC North
7,7,8,New York Giants,"1,305",687,585,33,0.539,1925,NFC East
8,8,9,Denver Broncos,884,470,404,10,0.537,1960,AFC West
9,9,10,San Francisco 49ers,"1,002",528,460,14,0.534,1950,NFC West
10,10,11,Pittsburgh Steelers,"1,179",614,538,20,0.532,1933,AFC North
11,11,12,Oakland Raiders,884,462,411,11,0.529,1960,AFC West

In [15]:
nfl_frame.sort_values('Lost')

,Unnamed: 0,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
6,6,7,Baltimore Ravens,352,190,161,1,0.541,1996,AFC North
3,3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
0,0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
4,4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East
5,5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North
8,8,9,Denver Broncos,884,470,404,10,0.537,1960,AFC West
11,11,12,Oakland Raiders,884,462,411,11,0.529,1960,AFC West
9,9,10,San Francisco 49ers,"1,002",528,460,14,0.534,1950,NFC West
10,10,11,Pittsburgh Steelers,"1,179",614,538,20,0.532,1933,AFC North
1,1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
2,2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
7,7,8,New York Giants,"1,305",687,585,33,0.539,1925,NFC East

In [16]:
nfl_frame.sort_values(['First NFL Season','Won'])

,Unnamed: 0,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
2,2,3,Chicago Bears,"1,370",749,579,42,0.562,1920,NFC North
1,1,2,Green Bay Packers,"1,336",737,562,37,0.565,1921,NFC North
7,7,8,New York Giants,"1,305",687,585,33,0.539,1925,NFC East
10,10,11,Pittsburgh Steelers,"1,179",614,538,20,0.532,1933,AFC North
9,9,10,San Francisco 49ers,"1,002",528,460,14,0.534,1950,NFC West
11,11,12,Oakland Raiders,884,462,411,11,0.529,1960,AFC West
8,8,9,Denver Broncos,884,470,404,10,0.537,1960,AFC West
4,4,5,New England Patriots[b],884,489,386,9,0.558,1960,AFC East
0,0,1,Dallas Cowboys,882,502,374,6,0.573,1960,NFC East
5,5,6,Minnesota Vikings,870,470,390,10,0.546,1961,NFC North
3,3,4,Miami Dolphins,800,445,351,4,0.559,1966,AFC East
6,6,7,Baltimore Ravens,352,190,161,1,0.541,1996,AFC North

# Missing data

In [17]:
import numpy as np

In [18]:
from numpy import nan

In [19]:
data = Series(['one','two',nan,'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [20]:
data.isnull() # finding missing values

0    False
1    False
2     True
3    False
dtype: bool

In [21]:
np.sum(data.isnull())

1

In [22]:
data.notnull() # finding non-missing values

0     True
1     True
2    False
3     True
dtype: bool

In [23]:
data = data.dropna() # remove null values

In [24]:
data

0     one
1     two
3    four
dtype: object

In [25]:
dframe = DataFrame([[1,2,3],[nan,5,6],[7,nan,9],[nan,nan,nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [26]:
np.sum(dframe.isnull(), axis = 0)

0    2
1    2
2    1
dtype: int64

In [27]:
clean_dframe = dframe.dropna() # removes all rows for which there is one or more null values
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [28]:
dframe.dropna(how='all') # removes rows for which all data is missing or null`

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [29]:
dframe.dropna(thresh=2)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [30]:
dframe.dropna(axis=1) # as usual, default is by row (i.e. axis = 0)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [31]:
dframe2 = DataFrame([[1,2,3,nan],[2,nan,5,6],[nan,7,nan,9],[1,nan,nan,nan]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

Options for using dropna
<br>[1] dframe.dropna(): drops all rows in which <b>ANY</b> of the values are missing
<br>[2] dframe.dropna(how = 'all'): drops rows in which <b>ALL</b> values are missing
<br>[3] dframe.dropna(thresh = n): drops rows which have less than n <b>NON-MISSING</b> values

In [32]:
dframe2.dropna(thresh = 2) 
# drop rows that have less than two non-missing values
# i.e. only keep rows that have at least two non-missing

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [33]:
dframe2.dropna(thresh = 3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [34]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [35]:
dframe2.fillna(999) # replace NAs with the value supplied

       0      1      2      3
0    1.0    2.0    3.0  999.0
1    2.0  999.0    5.0    6.0
2  999.0    7.0  999.0    9.0
3    1.0  999.0  999.0  999.0

In [36]:
dframe2.columns = ['Col1','Col2','Col3','Col4']

In [37]:
dframe2

   Col1  Col2  Col3  Col4
0   1.0   2.0   3.0   NaN
1   2.0   NaN   5.0   6.0
2   NaN   7.0   NaN   9.0
3   1.0   NaN   NaN   NaN

In [39]:
mean1 = dframe2['Col1'].mean()
mean2 = dframe2['Col2'].mean()
mean3 = dframe2['Col3'].mean()
mean4 = dframe2['Col4'].mean()

In [40]:
mean1

1.3333333333333333

In [41]:
mean2

4.5

In [42]:
dframe2

   Col1  Col2  Col3  Col4
0   1.0   2.0   3.0   NaN
1   2.0   NaN   5.0   6.0
2   NaN   7.0   NaN   9.0
3   1.0   NaN   NaN   NaN

In [43]:
dframe2.fillna({'Col1':mean1,'Col2':mean2,'Col3':mean3,'Col4':mean4}) # fill each column with a particular (different) value

       Col1  Col2  Col3  Col4
0  1.000000   2.0   3.0   7.5
1  2.000000   4.5   5.0   6.0
2  1.333333   7.0   4.0   9.0
3  1.000000   4.5   4.0   7.5

In [44]:
dframe2.fillna(0)

   Col1  Col2  Col3  Col4
0   1.0   2.0   3.0   0.0
1   2.0   0.0   5.0   6.0
2   0.0   7.0   0.0   9.0
3   1.0   0.0   0.0   0.0

In [45]:
dframe2 # original dframe is unchanged

   Col1  Col2  Col3  Col4
0   1.0   2.0   3.0   NaN
1   2.0   NaN   5.0   6.0
2   NaN   7.0   NaN   9.0
3   1.0   NaN   NaN   NaN

In [46]:
dframe2.fillna(0,inplace = True) # changes the original data frame

In [47]:
dframe2

   Col1  Col2  Col3  Col4
0   1.0   2.0   3.0   0.0
1   2.0   0.0   5.0   6.0
2   0.0   7.0   0.0   9.0
3   1.0   0.0   0.0   0.0

## End of part 5